Documents/СборкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СборкаТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатусУказанияСерий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>MRS_ДополнительныеАкцизныеМарки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/MRS_Сервер/Ext/Module.bsl
Процедура ОбработкаПроведенияСборкаТоваров(ЭтотОбъект, Отказ) Экспорт 
	
	Если ЭтотОбъект.Ссылка.Пустая() Тогда 
		Возврат;
	КонецЕсли;
	
	питРазрешитьЗаписьТиповогоДокумента = Ложь;
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("питРазрешитьЗаписьТиповогоДокумента") тогда 
		питРазрешитьЗаписьТиповогоДокумента = ЭтотОбъект.ДополнительныеСвойства.питРазрешитьЗаписьТиповогоДокумента;
	КонецЕсли;
	
	MRS_АвтоматическоеПроведение = Ложь;
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("MRS_АвтоматическоеПроведение") тогда 
		питРазрешитьЗаписьТиповогоДокумента = ЭтотОбъект.ДополнительныеСвойства.MRS_АвтоматическоеПроведение;
	КонецЕсли;
	
	Если (питРазрешитьЗаписьТиповогоДокумента ИЛИ питТиповыеДокументы.НайтиДокументпитДляТиповогоДокумента(ЭтотОбъект.Ссылка)) ИЛИ MRS_АвтоматическоеПроведение Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СборкаТоваровТовары.Ссылка КАК Ссылка,
		|	СУММА(СборкаТоваровТовары.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	Документ.СборкаТоваров.Товары КАК СборкаТоваровТовары
		|ГДЕ
		|	СборкаТоваровТовары.Ссылка = &Ссылка
		|	И СборкаТоваровТовары.Номенклатура.ВидАлкогольнойПродукции.Маркируемый = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	СборкаТоваровТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоличествоАкцизныхМарок.СсылкаНаДокумент КАК СсылкаНаДокумент,
		|	СУММА(КоличествоАкцизныхМарок.КоличествоАкциз) КАК КоличествоАкциз
		|ИЗ
		|	(ВЫБРАТЬ
		|		СборкаТоваровСерии.Ссылка КАК СсылкаНаДокумент,
		|		1 КАК КоличествоАкциз
		|	ИЗ
		|		Документ.СборкаТоваров.Серии КАК СборкаТоваровСерии
		|	ГДЕ
		|		СборкаТоваровСерии.Ссылка = &Ссылка
		|		И СборкаТоваровСерии.Номенклатура.ВидАлкогольнойПродукции.Маркируемый = ИСТИНА
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СборкаТоваровMRS_ДополнительныеАкцизныеМарки.Ссылка,
		|		СУММА(1)
		|	ИЗ
		|		Документ.СборкаТоваров.MRS_ДополнительныеАкцизныеМарки КАК СборкаТоваровMRS_ДополнительныеАкцизныеМарки
		|	ГДЕ
		|		СборкаТоваровMRS_ДополнительныеАкцизныеМарки.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СборкаТоваровMRS_ДополнительныеАкцизныеМарки.Ссылка) КАК КоличествоАкцизныхМарок
		|
		|СГРУППИРОВАТЬ ПО
		|	КоличествоАкцизныхМарок.СсылкаНаДокумент";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	КоличествоУпаковокПоНоменклатуре = РезультатЗапроса[0].Выгрузить()[0].КоличествоУпаковок;
	
	Если КоличествоУпаковокПоНоменклатуре >= 1 И ЗначениеЗаполнено(ЭтотОбъект.MRS_АкцизнаяМарка) Тогда
		КоличествоУпаковокПоНоменклатуре = КоличествоУпаковокПоНоменклатуре - 1;
	КонецЕсли;
	
	Если РезультатЗапроса[1].Пустой() Тогда
		КоличествоУпаковокПоМаркам = 0;
	Иначе 
		КоличествоУпаковокПоМаркам = РезультатЗапроса[1].Выгрузить()[0].КоличествоАкциз;
	КонецЕсли;
	
	Если КоличествоУпаковокПоНоменклатуре <> КоличествоУпаковокПоМаркам Тогда
		ШаблонОшибки = "Количество алкогольной продукции по данным документа не совпадает
		|с количеством серий + акцизных марок! Укажите акцизные марки!";
		
		ТекстОшибки = СтрШаблон(ШаблонОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	КонецЕсли;
		
КонецПроцедуры
